# Задача 2: Найдите сумму цифр трехзначного числа.

# *Пример:*

# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) |

# num = int(input("введи цифру"))
# sum = 0
# while num > 0:
#     i = num % 10
#     sum = sum + i  
#     num = num // 10
# print(sum) 

# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе они
#  сделали S журавликов. Сколько журавликов сделал каждый ребенок, если 
# известно, что Петя и Сережа сделали одинаковое количество журавликов, а 
# Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

# *Пример:*

# 6 -> 1  4  1
# 24 -> 4  16  4
# 60 -> 10  40  10

# cranes = int(input("общее кол-во журавликов"))
# Petr = cranes//6
# Serj = cranes//6
# Kate = Petr * 4
# print(Serj, Kate, Petr)

# Задача 6: Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались 
# за проезд и получали билет с номером. Счастливым билетом называют такой билет с 
# шестизначным номером, где сумма первых трех цифр равна сумме последних трех. Т.е.
# билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6. Вам требуется написать 
# программу, которая проверяет счастливость билета.

# ticket = input('номер билета')
# sum1=int(ticket[0]) + int(ticket[1]) +int(ticket[2])
# sum2=int(ticket[3]) + int(ticket[4]) +int(ticket[5])
# if sum1==sum2:
#     print('счастливый билет')
# else:
#     print('тебе не повезло')

# Задача 8: Требуется определить, можно ли от шоколадки размером n × m долек отломить k долек, если разрешается сделать один разлом по прямой между дольками (то есть разломить шоколадку на два прямоугольника).

# *Пример:*

# 3 2 4 -> yes
# 3 2 1 -> no

# width = int(input('введите ширину шоколадки'))
# thickness = int(input('введите толщину шоколадки'))
# segment  = int(input('введите сколько долек хотите отделить'))
# if width*thickness>segment:
#     if segment%width==0 or segment%thickness==0:
#         print('yes')
#     else: print('no')
# else: print('no')